app/controllers/bear_shouts_controller.rb

SELECT * FROM "bear_shouts" WHERE ("bear_shouts"."id" = 1)
---
  def show
    @bear_shout = BearShout.find(params[:id])

INSERT INTO "bear_shouts" ("name", "rating", "created_at", "updated_at", "content", "date_added") VALUES('Macker', 0, '2009-02-07 16:30:47', '2009-02-07 16:30:47', 'This should be considered a pretty long entry. Lorem ipsum, dolor sit amet. Lorem ipsum, dolor sit amet. Lorem ipsum, dolor sit amet. Lorem ipsum, dolor sit amet. Lorem ipsum, dolor sit amet. Lorem ipsum, dolor sit amet.
---
  def create
    @bear_shout = BearShout.new(params[:bear_shout])
    @bear_shout.date_added = DateTime.now()
    @bear_shout.rating = 0

    respond_to do |format|
      if verify_recaptcha(@bear_shout) && @bear_shout.save

SELECT * FROM "bear_shouts" WHERE ("bear_shouts"."id" = 8)
UPDATE "bear_shouts" SET "updated_at" = '2009-02-07 14:01:23', "content" = 'afsdafdsfsda' WHERE "id" = 8
---
  def update
    @bear_shout = BearShout.find(params[:id])

    respond_to do |format|
      if @bear_shout.update_attributes(params[:bear_shout])

SELECT * FROM "bear_shouts" WHERE ("bear_shouts"."id" = 1)
DELETE FROM "bear_shouts" WHERE "id" = 1
---
  def destroy
    @bear_shout = BearShout.find(params[:id])
    @bear_shout.destroy